avr-rust/avrd/packs/atmega/ATmega8HVA.atdf
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
        <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." mask="0x02" name="PA1DID"/>
          <bitfield caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." mask="0x01" name="PA0DID"/>
        </register>
        <register caption="Power Reduction Register 0" name="PRR0" offset="0x64" size="1">
          <bitfield caption="Power Reduction Voltage Regulator Monitor" mask="0x20" name="PRVRM"/>
          <bitfield caption="Power reduction SPI" mask="0x08" name="PRSPI"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x04" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x02" name="PRTIM0"/>
          <bitfield caption="Power Reduction V-ADC" mask="0x01" name="PRVADC"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x03" name="CLKPS"/>
        </register>
      </register-group>
      <value-group name="CPU_SLEEP_MODE_3BITS" caption="">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Reserved" name="VAL_0x02" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Power Off" name="POFF" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Reserved" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2E"/>
      </parameters>
    </module>
    <module caption="Battery Protection" name="BATTERY_PROTECTION">
      <register-group caption="Battery Protection" name="BATTERY_PROTECTION">
        <register caption="Battery Protection Parameter Lock Register" name="BPPLR" offset="0xFE" size="1" ocd-rw="R">
          <bitfield caption="Battery Protection Parameter Lock Enable" mask="0x02" name="BPPLE"/>
          <bitfield caption="Battery Protection Parameter Lock" mask="0x01" name="BPPL"/>
        </register>
        <register caption="Battery Protection Control Register" name="BPCR" offset="0xFD" size="1">
          <bitfield caption="Short Circuit Protection Disabled" mask="0x10" name="SCD"/>
          <bitfield caption="Discharge Over-current Protection Disabled" mask="0x08" name="DOCD"/>
          <bitfield caption="Charge Over-current Protection Disabled" mask="0x04" name="COCD"/>
          <bitfield caption="Discharge High-current Protection Disable" mask="0x02" name="DHCD"/>
          <bitfield caption="Charge High-current Protection Disable" mask="0x01" name="CHCD"/>
        </register>
        <register caption="Battery Protection Short-current Timing Register" name="BPHCTR" offset="0xFC" size="1" mask="0x3F"/>
        <register caption="Battery Protection Over-current Timing Register" name="BPOCTR" offset="0xFB" size="1" mask="0x3F"/>
        <register caption="Battery Protection Short-current Timing Register" name="BPSCTR" offset="0xFA" size="1" mask="0x7F"/>
        <register caption="Battery Protection Charge-High-current Detection Level Register" name="BPCHCD" offset="0xF9" size="1" mask="0xFF"/>
        <register caption="Battery Protection Discharge-High-current Detection Level Register" name="BPDHCD" offset="0xF8" size="1" mask="0xFF"/>
        <register caption="Battery Protection Charge-Over-current Detection Level Register" name="BPCOCD" offset="0xF7" size="1" mask="0xFF"/>
        <register caption="Battery Protection Discharge-Over-current Detection Level Register" name="BPDOCD" offset="0xF6" size="1" mask="0xFF"/>
        <register caption="Battery Protection Short-Circuit Detection Level Register" name="BPSCD" offset="0xF5" size="1" mask="0xFF"/>
        <register caption="Battery Protection Interrupt Flag Register" name="BPIFR" offset="0xF3" size="1">
          <bitfield caption="Short-circuit Protection Activated Interrupt Flag" mask="0x10" name="SCIF"/>
          <bitfield caption="Discharge Over-current Protection Activated Interrupt Flag" mask="0x08" name="DOCIF"/>
          <bitfield caption="Charge Over-current Protection Activated Interrupt Flag" mask="0x04" name="COCIF"/>
          <bitfield caption="Disharge High-current Protection Activated Interrupt" mask="0x02" name="DHCIF"/>
          <bitfield caption="Charge High-current Protection Activated Interrupt" mask="0x01" name="CHCIF"/>
        </register>
        <register caption="Battery Protection Interrupt Mask Register" name="BPIMSK" offset="0xF2" size="1">
          <bitfield caption="Short-circuit Protection Activated Interrupt Enable" mask="0x10" name="SCIE"/>
          <bitfield caption="Discharge Over-current Protection Activated Interrupt Enable" mask="0x08" name="DOCIE"/>
          <bitfield caption="Charge Over-current Protection Activated Interrupt Enable" mask="0x04" name="COCIE"/>
          <bitfield caption="Discharger High-current Protection Activated Interrupt" mask="0x02" name="DHCIE"/>
          <bitfield caption="Charger High-current Protection Activated Interrupt" mask="0x01" name="CHCIE"/>
        </register>
      </register-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="1" mask="0xFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
        <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
        <value caption="Write Only" name="VAL_0x02" value="0x02"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
          <bitfield caption="Clock Select1 bis" mask="0x07" name="CS" lsb="10"/>
        </register>
