avr-rust/avrd/packs/atmega/ATmega8HVA.atdf
        <register caption="Timer/Counter 1 Control Register A" name="TCCR1A" offset="0x80" size="1">
          <bitfield caption="Timer/Counter Width" mask="0x80" name="TCW1"/>
          <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN1"/>
          <bitfield caption="Input Capture Noise Canceler" mask="0x20" name="ICNC1"/>
          <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES1"/>
          <bitfield caption="Input Capture Select" mask="0x08" name="ICS1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x01" name="WGM10"/>
        </register>
        <register caption="Timer Counter 1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Output Compare Register 1A" name="OCR1A" offset="0x88" size="1" mask="0xFF"/>
        <register caption="Output Compare Register B" name="OCR1B" offset="0x89" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter n Input Capture Interrupt Enable" mask="0x08" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Output Compare B Interrupt Enable" mask="0x04" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter 1 Input Capture Flag" mask="0x08" name="ICF1"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag B" mask="0x04" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag A" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC0">
        <register caption="Timer/Counter0 Control Register" name="TCCR0A" offset="0x44" size="1">
          <bitfield caption="Timer/Counter Width" mask="0x80" name="TCW0"/>
          <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN0"/>
          <bitfield caption="Input Capture Noise Canceler" mask="0x20" name="ICNC0"/>
          <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES0"/>
          <bitfield caption="Input Capture Select" mask="0x08" name="ICS0"/>
          <bitfield caption="Clock Select0 bit 0" mask="0x01" name="WGM00"/>
        </register>
        <register caption="Timer/Counter0 Control Register" name="TCCR0B" offset="0x45" size="1">
          <bitfield caption="Clock Select0 bit 2" mask="0x04" name="CS02"/>
          <bitfield caption="Clock Select0 bit 1" mask="0x02" name="CS01"/>
          <bitfield caption="Clock Select0 bit 0" mask="0x01" name="CS00"/>
        </register>
        <register caption="Timer Counter 0  Bytes" name="TCNT0" offset="0x46" size="2" mask="0xFFFF"/>
        <register caption="Output compare Register A" name="OCR0A" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Output compare Register B" name="OCR0B" offset="0x49" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
          <bitfield caption="Timer/Counter n Input Capture Interrupt Enable" mask="0x08" name="ICIE0"/>
          <bitfield caption="Output Compare Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Output Compare Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter Interrupt Flag Register" mask="0x08" name="ICF0"/>
          <bitfield caption="Output Compare Flag" mask="0x04" name="OCF0B"/>
          <bitfield caption="Output Compare Flag" mask="0x02" name="OCF0A"/>
          <bitfield caption="Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
      </register-group>
    </module>
    <module caption="Coulomb Counter" name="COULOMB_COUNTER">
      <register-group caption="Coulomb Counter" name="COULOMB_COUNTER">
        <register caption="CC-ADC Control and Status Register A" name="CADCSRA" offset="0xE4" size="1">
          <bitfield caption="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." mask="0x80" name="CADEN"/>
          <bitfield caption="" mask="0x40" name="CADPOL"/>
          <bitfield caption="CC_ADC Update Busy" mask="0x20" name="CADUB"/>
          <bitfield caption="CC_ADC Accumulate Current Select Bits" mask="0x18" name="CADAS"/>
          <bitfield caption="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." mask="0x06" name="CADSI"/>
          <bitfield caption="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." mask="0x01" name="CADSE"/>
        </register>
        <register caption="CC-ADC Control and Status Register B" name="CADCSRB" offset="0xE5" size="1">
          <bitfield caption="" mask="0x40" name="CADACIE"/>
          <bitfield caption="Regular Current Interrupt Enable" mask="0x20" name="CADRCIE"/>
          <bitfield caption="CAD Instantenous Current Interrupt Enable" mask="0x10" name="CADICIE"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x04" name="CADACIF"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x02" name="CADRCIF"/>
          <bitfield caption="CC-ADC Instantaneous Current Interrupt Flag" mask="0x01" name="CADICIF"/>
        </register>
        <register caption="CC-ADC Instantaneous Current" name="CADIC" offset="0xE8" size="2" mask="0xFFFF"/>
        <register caption="ADC Accumulate Current" name="CADAC3" offset="0xE3" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC2" offset="0xE2" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC1" offset="0xE1" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC0" offset="0xE0" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="CC-ADC Regular Current" name="CADRC" offset="0xE6" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
      <register-group caption="Voltage Regulator" name="VOLTAGE_REGULATOR">
        <register caption="Regulator Operating Condition Register" name="ROCR" offset="0xC8" size="1" ocd-rw="R">
          <bitfield caption="ROC Status" mask="0x80" name="ROCS"/>
          <bitfield caption="ROC Warning Interrupt Flag" mask="0x02" name="ROCWIF"/>
          <bitfield caption="ROC Warning Interrupt Enable" mask="0x01" name="ROCWIE"/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
